In [1]:
import pandas as pd

In [2]:
# Read Excel file
df = pd.read_excel('M_A_data.xlsx', sheet_name='Data')

In [3]:
# overview
df.head()

,Deal Number,Acquiror Name,Acquiror State,Acquiror Nation,Acquiror SIC2,Acquiror SIC4,Acquiror High Tech Industry,Target Name,Target State,Target Nation,...,Deal Year of Announcement Date,Deal Status,Deal Completed,Deal Value,Deal Price per Share,Deal Target Share Price [T-1],Deal Premium (in %),Cross-border deal,Cross-industry deal,
0,master_deal_no,acq_name,acq_state,acq_nation,acq_sic2,acq_sic4,acq_hightech,tar_name,tar_state,tar_nation,...,deal_year,deal_status,deal_complete,deal_value,deal_price,deal_share,deal_premium,deal_crossborder,deal_crossindustry,
1,118827020,First West Capital Corp,California,United States,60,6021,0,Hotel Investors Trust,California,United States,...,1990,Withdrawn,0,66.769997,5.25,8.25,-36.363636,NaN,NaN,NaN
2,125504020,"Valley National Bancorp,NJ",New Jersey,United States,60,6021,0,Mayflower Financial Corp,California,United States,...,1990,Completed,1,21.209999,17,11,54.545456,NaN,NaN,NaN
3,140363020,Citicorp,New York,United States,60,6021,0,Brookfield Bancshares,Illinois,United States,...,1990,Completed,1,19.84,40.779999,43,-5.162793,NaN,NaN,NaN
4,143183020,"TrustCo Bank Corp,NY",New York,United States,60,6022,0,"National Savings Bank,Albany",New York,United States,...,1990,Withdrawn,0,44.310001,38.130001,28,36.178574,NaN,NaN,NaN

In [4]:
# make row at index 0 the new headers
df.columns = df.iloc[0]

# drop the old header
df = df.drop([0])
df = df.reset_index(drop=True)

In [5]:
# overiew of dataframe after changes
df.head()

,master_deal_no,acq_name,acq_state,acq_nation,acq_sic2,acq_sic4,acq_hightech,tar_name,tar_state,tar_nation,...,deal_year,deal_status,deal_complete,deal_value,deal_price,deal_share,deal_premium,deal_crossborder,deal_crossindustry,
0,118827020,First West Capital Corp,California,United States,60,6021,0,Hotel Investors Trust,California,United States,...,1990,Withdrawn,0,66.769997,5.25,8.25,-36.363636,NaN,NaN,NaN
1,125504020,"Valley National Bancorp,NJ",New Jersey,United States,60,6021,0,Mayflower Financial Corp,California,United States,...,1990,Completed,1,21.209999,17,11,54.545456,NaN,NaN,NaN
2,140363020,Citicorp,New York,United States,60,6021,0,Brookfield Bancshares,Illinois,United States,...,1990,Completed,1,19.84,40.779999,43,-5.162793,NaN,NaN,NaN
3,143183020,"TrustCo Bank Corp,NY",New York,United States,60,6022,0,"National Savings Bank,Albany",New York,United States,...,1990,Withdrawn,0,44.310001,38.130001,28,36.178574,NaN,NaN,NaN
4,143454020,IPCO Corp,New York,United States,50,5048,0,Royal International Optical,Texas,United States,...,1990,Withdrawn,0,87,12.25,9.625,27.272728,NaN,NaN,NaN

In [6]:
# check data types
df.dtypes

0
master_deal_no        object
acq_name              object
acq_state             object
acq_nation            object
acq_sic2              object
acq_sic4              object
acq_hightech          object
tar_name              object
tar_state             object
tar_nation            object
tar_sic2              object
tar_sic4              object
tar_hightech          object
tar_sales             object
tar_ebit              object
tar_ni                object
tar_assets            object
tar_eps               object
deal_date             object
deal_year             object
deal_status           object
deal_complete         object
deal_value            object
deal_price            object
deal_share            object
deal_premium          object
deal_crossborder      object
deal_crossindustry    object
                      object
dtype: object

### Excercise 14

#### 14a) What is the average “Deal premium”

In [7]:
column_name = "deal_premium"

# change data type to float for all rows starting from index 2
df[column_name] = df[column_name].astype(float)

# get mean for Deal Premium in percentages
df[column_name].mean()

33.3606314598331

#### 14b) What is the average deal premium for a high-tech target firm?

In [8]:
# turn features to numericals
df['tar_hightech'] = df['tar_hightech'].astype(int)

# compute mean only for firms in the high tech industry
df.loc[df['tar_hightech'] == 1, column_name].mean()

37.96077524085723

#### 14c) What is the average deal premium for a non-high-tech target firm?

In [10]:
# turn features to numericals
df['tar_hightech'] = df['tar_hightech'].astype(int)

# compute mean only for firms in the high tech industry
df.loc[df['tar_hightech'] == 0, column_name].mean()

31.319371576171733

#### 14d) What is the average deal premium for cross-border deals?

In [14]:
# compute mean of deal premium where acquiring nation is not the same as target nation
df.loc[df['acq_nation'] != df['tar_nation'], column_name].mean()

36.52026762388438

#### 14e) What is the average deal premium for domestic deals?

In [15]:
# compute mean of deal premium where acquiring nation is the same as target nation
df.loc[df['acq_nation'] == df['tar_nation'], column_name].mean()

32.61315729680437

#### 14f) What is the average deal premium for cross-industry deals?

In [16]:
df.loc[df['acq_sic4'] != df['tar_sic4'], column_name].mean()

33.5751981474247

#### 14g) What is the average deal premium for within-industry deals?

In [18]:
df.loc[df['acq_sic4'] == df['tar_sic4'], column_name].mean()

32.91870651793545

### Excercise 15

In [ ]:
# --- for each year from 1986 until 2015 --- #
# number of deals by year
# sum of deal values by year
# average deal value by year
# average deal premium by year

#### 15a) What is the correlation between number of deals in a year and the sum of the deal value? And between the number of deals and the average deal premium in that year?

#### 15b)  Based  on  this  information,  do  you  see  direct  evidence  for  M&A  waves?  If  so,  what  drives  the M&A wave: number of deals, size of deals, and/or premiums paid? (max 100 words)

### Excercise 16

### Excercise 17